<h2>Technik</h2>
<p>
  Meistens sind die Projektoren au&szlig;erhalb der CAVE (R&uuml;ckprojektion)
  und durch zus&auml;tzliche Spiegel wird die Entfernung zu den W&auml;nden noch
  verringert. Computer generieren zwei Bilder, eins f&uuml;r jedes Auge, welche
  dann auf die W&auml;nde projiziert werden. Eine LCD Shutter-Brille die mit den
  Projektoren synchronisiert wird, liefert dann f&uuml;r das jeweilige Auge das
  korrekte Bild. Ebenfalls sind in verschiedenen Ecken der CAVE Lautsprecher
  installiert um so eine 3D Audioausgabe zu erm&ouml;glichen. Diese wird
  ebenfalls von den Computern gesteuert um die Audioausgabe synchron zur
  Bildausgabe zu halten.
</p>
<p>
  Damit die Personen innerhalb der CAVE nicht von au&szlig;en gest&ouml;rt
  werden muss die CAVE gut gegen helles Licht wie auch St&ouml;rger&auml;usche
  von au&szlig;en abgeschirmt werden.
</p>
<p>
  Die angesprochene R&uuml;ckprojektion stellt dabei noch besondere
  Anforderungen an das Material der W&auml;nde, die Transluzent, also f&uuml;r
  Licht halb durchl&auml;ssig sein m&uuml;ssen, und auch an die Projektoren, die
  eine hohe Leuchtst&auml;rke haben m&uuml;ssen. Wenn auch Bilder auf den Boden
  projiziert werden sollen, so muss noch beachtet werden, dass das Material dem
  entsprechend unempfindlich gegen&uuml;ber Kratzern ist, da auf dem Boden
  gelaufen wird. Bei einem sechs Seiten CAVE muss man sich au&szlig;erdem
  Gedanken machen, wie das mit dem Ein- und Ausgang gel&ouml;st wird, und wie
  eine ausreichende Luftversorgung gew&auml;hrleistet werden kann.
</p>
<p>
  Eine weitere M&ouml;glichkeit ist die Aufprojektion, bei der von vorne auf die
  W&auml;nde Bilder projiziert werden. Dies w&uuml;rde nicht so hohe
  Anforderungen an das Material stellen, allerdings w&auml;re dann darauf zu
  achten, dass die Projektoren nicht dem Bild weiterer Projektoren oder den
  Nutzern im Weg sind. In einer sechs Seiten CAVE w&auml;re diese L&ouml;sung
  dadurch schon ausgeschlossen.
</p>
<p><br /></p>
<p><b>Weitere Entwicklung</b></p>
<p>
  Da die Hardwarekosten f&uuml;r einen solchen CAVE mit sechs Seiten gro&szlig;
  sind und diese auch viel Platz beansprucht, wie auch weitere Anforderungen mit
  sich bringt, wurden mittlerweile Varianten entworfen mit weniger
  Projektionsfl&auml;chen wie z.B. den Immersion Square.
</p>
