<h2><a id="Militaer"></a>Milit&auml;r <a href="#quelle1">[1]</a></h2>

<h4><a id="Kampfflugzeuge"></a>Kampfflugzeuge</h4>

Fr&uuml;her war die Navigation und die Zielerfassung in einem Kampfflugzeug sehr
umst&auml;ndlich und schwierig. Beispielsweise musste ein Pilot, um einen Gegner
zu erfassen, dass gesamte Flugzeug in Richtung des Gegners drehen. Gleichzeitig
durften nat&uuml;rlich nicht die Daten im Cockpit au&szlig;er Acht gelassen
werden. Aufgrund dessen wurde vom Piloten ein hohes fliegerisches K&ouml;nnen
und eine gute Konzentrationsf&auml;higkeit gefordert. Dies stellte eine extreme
Belastung dar. Die Arbeit eines Kampfpiloten ist heute sicherlich immer noch
sehr Anspruchsvoll, diverse AR-Systeme erleichtern die Arbeit aber erheblich.
<br />
Zwei Systeme spielen f&uuml;r die Piloten eine entscheidende Rolle. Einmal das
HUD (Head-up-Display). Es stellt Flugdaten, Radar, Waffensysteme und
Zielerfassung Kompakt und &Uuml;bersichtlich direkt auf der Frontscheibe dar.
W&auml;hrend den Fl&uuml;gen hat der Pilot zus&auml;tzlich die M&ouml;glichkeit,
verschiedene Modi zu w&auml;hlen. Diese unterst&uuml;tzen die Navigation, den
Landeanflug und den Gebrauch verschiedener Waffen und Raketen. Das zweite System
ist das HMD (Head-mounted-Display). Es ist meist direkt im Helm integriert und
besitzt Bewegungssensoren. Diese erfassen die Kopfbewegung des Piloten und
erm&ouml;glichen eine direkte Zielerfassung. Der Pilot muss nur sein Ziel
ansehen und trifft automatisch das Ziel. Audio- und Videosignale signalisieren
die Fixierung des Gegners. Des Weiteren erh&auml;lt der Pilot diverse hilfreiche
Informationen auf sein Visier projiziert und kann zwischen Videobildern aus Tag-
und Nachtsicht w&auml;hlen, welche mit zus&auml;tzlichen Symbolen kombiniert
sind. Werden Bilder von externen Quellen ben&ouml;tigt, k&ouml;nnen diese
ebenfalls direkt auf das Visier projiziert werden.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/topsight.jpg"
    alt="TopSight (FRA)"
  />
  <br />
  <a href="#abbildung1">Abbildung 1: TopSight (FRA)</a>
</p>
<br />

<h4><a id="Kampfhubschrauber"></a>Kampfhubschrauber</h4>

F&uuml;r einen Kampfhubschrauberpiloten bestehen vergleichbar extreme
Geschwindigkeiten und Fliehkr&auml;fte nicht. Daf&uuml;r befindet er sich meist
im Tiefflug und ben&ouml;tigt deshalb einen gr&ouml;&szlig;eren Sichtbereich und
eine erh&ouml;hte Aufl&ouml;sung. Das FLIR (Forward Looking Infrared)
erm&ouml;glicht eine sehr detaillierte Sicht bei Nacht, da es W&auml;rmequellen
erfassen kann. Die sehr empfindlichen Kameras ermitteln die Infrarotstrahlung
der W&auml;rmequellen und stellen diese heller als Kalte Objekte dar. Aufgrund
dessen ist ein positionsgenaues Sehen auch bei v&ouml;lliger Dunkelheit
m&ouml;glich. Auch Kampfhubschrauberpiloten besitzen ein HMD, welches unter
anderem die Kopfbewegung aufnimmt und Flugdaten ausgibt.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/anvis.jpg"
    alt="ANVIS (USA)"
  />
  <br />
  <a href="#abbildung2">Abbildung 2: ANVIS (USA)</a>
</p>
<br />

<h4><a id="Panzer"></a>Panzer</h4>

F&uuml;r die Unterst&uuml;tzung der Soldaten in Panzern gibt es ein
entscheidendes Ziel: Der Soldat soll innerhalb des Panzers dasselbe sehen, als
wenn er den Kopf aus dem Panzer streckt. Daf&uuml;r besitzen Panzerfahrer ein
hochaufl&ouml;sendes HMD und verf&uuml;gen &uuml;ber FLIR-Sensoren. Da es
w&auml;hrend Eins&auml;tzen zu verschiedenen Reperaturszenarien kommen kann,
k&ouml;nnen sich die Soldaten im Panzer Reperatur-Checklisten, St&uuml;cklisten
und Schaltpl&auml;ne f&uuml;r milit&auml;rische Fahrzeuge und Ausr&uuml;stungen
&uuml;ber das HMD anzeigen lassen. Verschiedene Anzeigemodi erleichtern die
Arbeit im Kampf, bei der Navigation und Reperatur.

<h4><a id="Infanterie"></a>Infanterie</h4>

Bei der technischen Ausr&uuml;stung f&uuml;r Fu&szlig;soldaten sticht vor allem
das Land Warrior Programm der USA heraus. Jeder Soldat ist mit einem HMD
ausgestattet, welches &uuml;ber ein Positions- und Navigationssystem
verf&uuml;gt, eine M&ouml;glichkeit zur Digital- und Sprachkommunikation bietet,
die Darstellung diverser Aufnahmen von Aufkl&auml;rungsdrohnen,
Geheimdienstinformationen und Bildern von &Uuml;berwachungskameras zul&auml;sst
und die Positionen verb&uuml;ndeter Soldaten und Gegnern anzeigen kann.
Zus&auml;tzlich kann es Bilder eines an der Waffe befestigten Thermal Weapon
Sight (TWS) Systems anzeigen, welches es erm&ouml;glicht, um die Ecke schauen
ohne die Deckung aufzugeben. Die gr&ouml;&szlig;ten Probleme dieser
Ausr&uuml;stung liegen im Gewicht und dem hohen Energieverbrauch.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/landwarrior.jpg"
    alt="Land Warrior (USA)"
  />
  <br />
  <a href="#abbildung3">Abbildung 3: Land Warrior (USA)</a>
</p>
<br />

Das Land Warrior Programm ist seit 1994 in der Entwicklung und wurde 2005 in das
Future Force Warrior Programm (FFW) integriert. Folgeprogramme sind bereits
geplant.

<h4><a id="Simulation_und_Training"></a>Simulation und Training</h4>

Je besser das Training, umso h&ouml;her ist die
&Uuml;berlebenswahrscheinlichkeit! Dieser Leitspruch beschreibt deutlich den
Stellenwert von Simulation und Training beim Milit&auml;r. Auch wenn die drei
vorgestellten Trainingsprogramme im Wesentlichen zur Virtual Reality
geh&ouml;ren, werden sie trotzdem kurz der Vollst&auml;ndigkeit halber
erl&auml;utert. Der Aviation Combined Arms Tactical Trainer - Aviation
Reconfigurable Manned Simulator (AVCATT-A) der USA ist eine bestimmte Ausbildung
f&uuml;r Kampfhubschrauberpiloten. Es handelt sich dabei um einen reinen
Kampfsimulator, ohne Aspekte eines Flugsimulators. Er besteht aus zwei
Containern, welche jeweils 16m lang sind. Innerhalb der Container befindet sich
der Simulator selber, sowie ein Schulungsraum mit 20 Pl&auml;tzen zur
Besprechung und ein Kontroll- und Wartungsraum. Jeder Simulator ist mit anderen
Simulatoren kombinierbar, f&uuml;r die kollektive Missionsvorbereitung. Die
Flight School XXI der USA ist der allgemein gebr&auml;uchliche Simulator
f&uuml;r die Flugausbildung von Kampfhubschrauberpiloten. Die Bradley A3
Embedded Tactical Training Initiative (BETTI) des Vereinigten K&ouml;nigreichs
und der USA ist ein eingebauter Simulator in amerikanischen Bradley
Kampffahrzeugen. Es wird ein gewisses Terrain simuliert und die Soldaten
innerhalb des Panzers k&ouml;nnen unter realen Bedingungen trainieren. Dies
dient vor allem der Missionsvorbereitung.

<h4><a id="Vor_und_Nachteile"></a>Vor- und Nachteile</h4>

Vorteile der AR-Systeme beim Milit&auml;r liegen auf der Hand:
<ul>
  <li>Tieffl&uuml;ge mit hoher Geschwindigkeit sonst kaum m&ouml;glich</li>
  <li>Zeitersparnis, da Informationen geballt geliefert werden</li>
  <li>Geschwindigkeit mit der Ziele erfasst werden k&ouml;nnen</li>
  <li>Steigert Leistungsf&auml;higkeit und Sicherheit des Soldaten</li>
  <li>
    Es kann auf die reale Simulation verzichtet werden (Sprengstoff, etc) ->
    Billiger!
  </li>
  <li>Es werden Verletzungen durch menschliches Versagen vermieden</li>
</ul>

Trotz allen Vorteilen gibt es auch entscheidende Nachteile:
<ul>
  <li>Tunnelblick (Reale Umgebung bekommt zu wenig Beachtung)</li>
  <li>
    Anwender k&ouml;nnen oft nicht virtuelle und reale Informationen
    gleichzeitig verarbeiten
  </li>
  <li>
    Registrierungsproblem, wenn sich virtuelle Informationen und reale Objekte
    nicht 1:1 &uuml;berlagern
  </li>
  <li>Virtuelle Informationen &uuml;berdecken reale Objekte</li>
  <li>Latenz f&uuml;hrt zu Schwindel und &Uuml;belkeit</li>
  <li>Zus&auml;tzliches Gewicht bei den Fu&szlig;soldaten</li>
</ul>

<h2><a id="Abbildungsverzeichnis"></a>Abbildungsverzeichnis</h2>

<p>
  <a id="abbildung1"></a>[1]
  <a
    href="http://winfwiki.wi-fom.de/images/b/bc/Einsatz_in_Flugzeugen_TOPSIGHT.JPG"
    target="_blank"
    >http://winfwiki.wi-fom.de/images/b/bc/Einsatz_in_Flugzeugen_TOPSIGHT.JPG
  </a>
</p>

<p>
  <a id="abbildung2"></a>[2]
  <a
    href="http://winfwiki.wi-fom.de/images/1/1b/Einsatz_in_Hubschraubern_ANVIS.JPG"
    target="_blank"
    >http://winfwiki.wi-fom.de/images/1/1b/Einsatz_in_Hubschraubern_ANVIS.JPG
  </a>
</p>

<p>
  <a id="abbildung3"></a>[3]
  <a
    href="http://winfwiki.wi-fom.de/images/5/5a/LandWarrior_Soldat.JPG"
    target="_blank"
    >http://winfwiki.wi-fom.de/images/5/5a/LandWarrior_Soldat.JPG
  </a>
</p>

<h2><a id="Quellenverzeichnis"></a>Quellenverzeichnis</h2>

<p>
  <a id="quelle1"></a>[1]
  <a
    href="http://winfwiki.wi-fom.de/index.php/Augmented_Reality_beim_Milit%C3%A4r"
    target="_blank"
    >Augmented Reality beim Milit&auml;r, Mejdi Jelassi, Hakki Sahin,
    http://winfwiki.wi-fom.de/index.php/Augmented_Reality_beim_Milit%C3%A4r
  </a>
</p>
