<h1>Raumfahrt <a id="Raumfahrt" href="#quelle1">[1]</a></h1>
<h4><a id="Allgemeines"></a>Allgemeines</h4>

Der Raumfahrtalltag besteht aus harter Arbeit und komplizierten Aufgaben. Es
werden verschiedenste Instrumente benutzt und dabei werden meist viele
Komponenten gleichzeitig ben&ouml;tigt.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/instrumente_und_material.jpg"
    alt="Instrumente und Material"
  />
  <br />
  <a href="#abbildung1">Abbildung 1: Instrumente und Material</a>
</p>

Die Aufgaben eines Astronauten sind neben den speziellen Missionen
haupts&auml;chlich die Instandhaltung und Wartung der bereits bestehenden
Systeme. F&uuml;r jeden Aufgabe gibt es eine umfangreiche Anleitung, welche
Schritt f&uuml;r Schritt abgearbeitet werden muss.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/anleitungen_und_instruktionen.jpg"
    alt="Anleitungen und Instruktionen"
  />
  <br />
  <a href="#abbildung2">Abbildung 2: Anleitungen und Instruktionen</a>
</p>

Das Halten und Lesen dieser Papieranleitungen ist allerdings ziemlich
umst&auml;ndlich, denn sie sind sperrig und st&ouml;ren beim der eigentlichen
Bearbeitung der Aufgaben. An diesem Punkt setzt nun die Technik der Augmented
Reality an.

<h4><a id="WEAR"></a>Wearable Augmented Reality (WEAR)</h4>
Das sog. WEAR besteht aus einem HMD (Head-mounted-Display). Dieses setzt sich
aus den folgenden Komponenten zusammen:
<ul>
  <li>mobiler Computer</li>
  <li>Headset</li>
  <li>Display</li>
  <li>2 Kameras zum Lesen von Barcodes zum Erkennen von Objekten (im Raum)</li>
  <li>Tr&auml;gheitsnavigationssystem - Inertial Measurement Unit (IMU)</li>
</ul>

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/hmd.jpg"
    alt="HMD"
  />
  <br />
  <a href="#abbildung3">Abbildung 3: HMD</a>
</p>

Die Aufgabe dieses Systems ist die teilweise &Uuml;berlagerung der Realit&auml;t
mit zus&auml;tzlichen Informationen. Dies sind pr&auml;zise Informationen
&uuml;ber Objekte im Blickfeld des Astronauten, 3D-Grafiken sowie weitere
Datenauflistungen. Dar&uuml;ber hinaus soll das System nun auch die
Schritt-f&uuml;r-Schritt-Anleitungen zur Verf&uuml;gung stellen.
<br />
<br />
Das WEAR unterst&uuml;tzt zur Ausf&uuml;hrung dieser Aufgaben mehrere
Funktionen. Die Spracherkennung dient haupts&auml;chlich der Steuerung des
gesamten Systems und ist somit die Schnittstelle zum Astronauten. Des Weiteren
kann das WEAR mit Hilfe der Visualisierung des Raums Objekte erkennen. Auf
diesen Objekten k&ouml;nnen sich Barcodes befinden. Diese werden vom System
eingescannt und mit der Inventardatenbank der Raumstation verglichen. Somit
k&ouml;nnen alle verf&uuml;gbaren Informationen &uuml;ber diese Objekte direkt
visualisiert werden. Zur Orientierung im Raum verf&uuml;gt das System neben der
reinen Objekterkennung auch &uuml;ber eine Positionserkennung. Diese
aktualisiert sich automatisch bei Bewegung des Astronauten.
<br />
<br />
Der erste richtige Einsatz des WEAR Prototypen erfolgte in ESA's Columbus Modul.
Dies ist ein Modul auf der International Space Station (ISS). Der getestete
Prototyp basierte auf eher &auml;lterer Hardware. Dies kommt daher, dass jedes
Hardwareteil welches bei Weltraummissionen eingesetzt werden soll, speziellen
Sicherheits- und Kompatibilit&auml;tsanforderungen gen&uuml;gen muss. Das Testen
von aktueller Hardware h&auml;tte in diesem Fall zu viel Zeit erfordert.
<br />

<p class="img">
  <img
    src="resources/novels/schmetterlingstraum/hintergrund-info/media/columbus_modul.jpg"
    alt="Columbus Modul"
  />
  <br />
  <a href="#abbildung4">Abbildung 4: Columbus Modul</a>
</p>

Die Aufgabe bei diesem Test war das Austauschen eines Filters. Dabei sollte das
WEAR mittels Sprachbefehlen navigiert werden. Es sollten alle ben&ouml;tigten
Informationen, Diagramme und Anleitungen aufgerufen werden und es sollte
insgesamt weitestgehend freih&auml;ndig gearbeitet werden. Diese
Testanforderungen konnte alle erfolgreich erf&uuml;llt werden.
<br />
<br />
Die Entwicklung des WEAR Systems ist noch lange nicht abgeschlossen. Allerdings
lassen sich daran schon einige Vorteile des Einsatzes von Augmented Reality in
der Raumfahrt erkennen. Es wird weitestgehend freih&auml;ndiges Arbeiten
erm&ouml;glicht, da die Papieranleitungen nicht mehr ben&ouml;tigt werden und
der Astronaut hat direkten Zugriff auf alle wichtigen Informationen aller
Objekte im Blickbereich. Dadurch ergibt sich letztendlich ein Zeit- wie auch ein
Qualit&auml;tsgewinn. Wichtig ist allerdings, dass das System absolut fehlerfrei
arbeitet, da ansonsten eventuell eine immense Gef&auml;hrdung f&uuml;r die
Mission bzw. die Aufgabe entsteht.

<h2><a id="Abbildungsverzeichnis"></a>Abbildungsverzeichnis</h2>

<p>
  [1]
  <a
    id="abbildung1"
    href="http://www.esa.int/images/CIMG0339.JPG"
    target="_blank"
    >http://www.esa.int/images/CIMG0339.JPG
  </a>
</p>

<p>
  [2]
  <a
    id="abbildung2"
    href="http://www.esa.int/images/CIMG0335.JPG"
    target="_blank"
    >http://www.esa.int/images/CIMG0335.JPG
  </a>
</p>

<p>
  [3]
  <a
    id="abbildung3"
    href="http://www.esa.int/images/IMG_1706_frank.jpg"
    target="_blank"
    >http://www.esa.int/images/IMG_1706_frank.jpg
  </a>
</p>

<p>
  [4]
  <a
    id="abbildung4"
    href="http://www.esa.int/images/iss197,1.jpg"
    target="_blank"
    >http://www.esa.int/images/iss197,1.jpg
  </a>
</p>

<h3><a id="Quellenverzeichnis"></a>Quellenverzeichnis</h3>

<p>
  [1]
  <a
    id="quelle1"
    href="http://www.esa.int/esaCP/SEMVX51OWUF_index_0.html"
    target="_blank"
    >European Space Agency (22 September 2009),
    http://www.esa.int/esaCP/SEMVX51OWUF_index_0.html
  </a>
</p>
