<h2>Tracking f&uuml;r Virtuelle Umgebungen</h2>
<p>
  Zur Immersiven Virtuellen Realit&auml;t geh&ouml;rt nicht nur die realistische
  Ausgabe, sondern auch die Eingabe und die damit verbundene
  Interaktivit&auml;t. Dabei gibt es mehrere M&ouml;glichkeiten dies zu
  bewerkstelligen. Hier kurz angesprochen werden die vier Hauptmethoden, ihre
  Funktionsweise und ihre Vor- und Nachteile.
</p>

<h2>Mechanisch:</h2>
<p>
  Bei dem Mechanischem verfahren wird eine Gestell mit Gelenken ben&ouml;tigt
  die einen fixen Punkt hat. Dabei wird an den Gelenken der Winkel gemessen um
  die aktuelle Position zu bestimmen. Diese Methode ist sehr schnell, da das
  Messger&auml;t direkt vor Ort ist und meist auch direkt mit dem System
  verbunden ist. Das Gestell kann die Position auch Millimeter genau messen, was
  f&uuml;r die Genauigkeit spricht. Dabei ist der Nachteil, dass das Ger&auml;t
  direkten Kontakt braucht und damit die Mobilit&auml;t und Bewegungsfreiheit
  stark einschr&auml;nkt.
</p>
<p></p>

<h2>Elektromagnetisch:</h2>
<p>
  Hierbei gibt es mehrere kleine Sender die mit Hilfe dreier Spulen Magnetfelder
  erzeugen. Der Empf&auml;nger misst durch seine angeordneten Spulen diese
  erzeugten Magnetfelder und deren Feldst&auml;rken, wodurch sich die Position
  bestimmen l&auml;sst. Das Positive sind die kleine Gr&ouml;&szlig;e der Sender
  die ben&ouml;tigt werden und auch die recht kurze Latenzzeit. Dabei hat es den
  schwerwiegenden Nachteil, das es durch gr&ouml;&szlig;ere Metallobjekte und
  auch Radios sehr leicht gest&ouml;rt wird und es hat auch eine geringe
  Reichweite.
</p>

<h2>Akustisch:</h2>
<p>
  Im Akustischem Fall benutzt das System Ultraschallwellen um die Position zu
  bestimmen. Dabei gibt es meist Station&auml;ren Empf&auml;nger, die in der
  Gegend positioniert sind und noch die Sender die meist am Menschen selber oder
  am Objekt befestigt sind. Die Sender schicken die Ultraschallwellen ab und die
  Empf&auml;nger messen dann die Zeit, die diese Schallwellen gebraucht haben um
  anzukommen und berechnen so die Distanz. Der Vorteil hierbei ist der Preis, da
  diese Systeme meist recht g&uuml;nstig sind. Sie haben auch ein recht
  gro&szlig;e Reichweite. Der Nachteil liegt an der Ungenauigkeit, da
  Temperatur, Luftdruck und Luftfeuchtigkeit die Schallwellen beeinflussen
  k&ouml;nnen und die Sender eher schwache Signale aussenden.
</p>

<h2>Optisch:</h2>
<p>
  Die Optischen Systeme kann man in aktive und passive unterteilen. Bei den
  aktiven werden Infrarot-LEDs als Markierung selber eingesetzt und beim
  passiven werden diese von den Kameras ausgestrahlt. Das Infrarote Licht wird
  vom Umgebungslicht getrennt und erfasst. So kann sehr genau die Position und
  Entfernung berechnet werden. Hierbei gibt es noch die M&ouml;glichkeit mehrere
  Kameras und Markierungen einzusetzen um die Genauigkeit zu steigern, wobei
  dies heutzutage auch mit nur einer Kamera und ohne Markierungen funktioniert.
  Das ganze hat dabei noch eine recht gute Latenzzeit, eine hohe Genauigkeit und
  eine gro&szlig;e Reichweite, daf&uuml;r ist der Nachteil, das es immer
  Sichtkontakt zum Objekt braucht und tote Winkel entstehen k&ouml;nnen.
</p>
<p></p>
<br />
<p>
  Es gibt nat&uuml;rlich auch Trackingger&auml;te, wie z.B. Maus, Tastatur,
  Joystick, Game Controller, Eye Tracker und noch andere Ger&auml;te mit der man
  Bewegungen oder Befehle des Benutzer bestimmten kann und in Zukunft werden
  bestimmt noch mehr bessere raus kommen, die dann immer pr&auml;ziser,
  schneller, mobiler und g&uuml;nstiger werden.
</p>
<p>
  Quellen:<br />
  <a
    href="http://www.computational-steering.org/seminar/Seminar_V2_Clemens_Spenrath.pdf"
    >http://www.computational-steering.org/seminar/Seminar_V2_Clemens_Spenrath.pdf</a
  ><br />
  <a href="http://www.vrs.org.uk/virtual-reality-gear%20/tracking.html"
    >http://www.vrs.org.uk/virtual-reality-gear%20/tracking.html</a
  ><br />
  <a
    href="http://electronics.howstuffworks.com/gadgets/other-gadgets/VR-gear6.htm"
    >http://electronics.howstuffworks.com/gadgets/other-gadgets/VR-gear6.htm</a
  ><br />
</p>
