<h2>Virtuelles TV Studio: Wie funktioniert das?</h2>

<p>
  Das Prinzip virtueller TV-Studios beruht auf der Verschmelzung von
  Studiotechnik und Computergrafik. Dabei wird die reale Kulisse (Blue-Box)durch
  eine virtuelle Kulisse ersetzt. Die Basis hierbei bilden 2D-pics und
  3D-Modelle. Wichtig dabei ist die Abstimmung von virtueller und realer Kamera,
  um ein fehlerfreies Bild zu erhalten.
</p>

<p>
  Beim Virtuellen TV-Studio kommen folgende Komponenten bzw. Techniken zum
  Einsatz:
</p>
<ul>
  <li>Kamera Tracking</li>
  <li>Echtzeit 3D Rendering (Software)</li>
  <li>Video Mixer</li>
  <li>Blue/Green Screen</li>
</ul>

<img
  src="resources/novels/schmetterlingstraum/kapitel-1/media/zdf_vts.jpg"
  alt="zdf_vts.jpg"
  class="img-fluid"
/>
<p>Abb. 1.1 Das neue virtuelle TV-Studio von der ZDF-Heute-Sendung</p>
<br />
<p>Allgemeine Funktionsweise des virtuellen TV-Studios:</p>
<p>
  Die Bewegung in den virtuellen Sets wird realisiert, indem die Bewegung der
  realen Kamera erfasst wird. In der Regel wird der Hintergrund durch ein vom
  Computer erzeugtes Bild ersetzt. Die handelnde Person bzw. das Objekt im
  Vordergrund wird durch die Kamera eingefangen. Die Kamera erfasst dabei
  bestimmte Parameter, sogenannte Tracking-Daten. Um Hintergrund und Vordergrund
  einander anzupassen, werden die vorher ermittelten Tracking-Daten verwendet.
  Anschlie&szlig;end wird das reale und virtuelle Bild kombiniert.
</p>
<br />
<p>
  <img
    src="resources/novels/schmetterlingstraum/kapitel-1/media/prinzip_vts.jpg"
    alt="prinzip_vts.jpg"
    class="img-fluid"
  />
</p>

<p>Abb. 1.2 Funktionsweise eines virtuellen TV-Studios</p>
<br />
<p>
  Virtuelle TV-Studios bieten einige Vorteile gegen&uuml;ber herk&ouml;mmlichen
  TV-Studios. Hauptvorteil von virtuellen Studios ist, dass die Erstellung der
  ben&ouml;tigten Kulissen durch Software realisiert werden kann. Dies
  f&uuml;hrt zu einer erheblichen Kosten- und Platzersparnis. Weiterhin ist es
  m&ouml;glich auf unvorhersehbare Ereignisse schnell und flexibel zu reagieren.
  Die virtuellen Kulissen k&ouml;nnen durch den Einbau von Effekten optisch
  interessanter gestaltet werden.
</p>
<p>
  Ein wesentliches Element im virtuellen TV Studio ist das sogenannte
  &bdquo;Tracking&ldquo;. Dieser Begriff bezeichnet das Verfahren, welches
  benutzt wird, um dem verarbeitenden Rechner mitzuteilen, wohin die Kamera
  &uuml;berhaupt zeigt und wo sich bewegenden Objekte befinden. Ohne dieses
  Verfahren w&auml;ren virtuelle TV Studios gar nicht m&ouml;glich, da die
  Position der virtuellen Kamera in der Computerberechnung der virtuellen
  Kulissen mit der realen im Studio &uuml;bereinstimmen muss.
</p>

<p>
  Generell gibt es drei Arten von Tracking im virtuellen TV Studio. Das
  &auml;lteste, elektromechanische, basiert auf einem Schienensystem, das im
  Studio verlegt ist. Auf dieser Schiene, die millimeter genau verlegt sein
  muss, f&auml;hrt die Kamera durch das Studio. Im Studio-Computer ist die
  Position und der Verlauf der Schiene gespeichert. Der Computer wei&szlig; also
  zu jedem Zeitpunkt ganz genau, wohin die Kamera zeigt.
</p>

<p>
  Ein neueres System basiert auf Infrarotkameras. Bei diesem System sind an der
  Studiodecke Infrarotkameras installiert und an der Studiokamera selber LEDs.
  Diese blitzen 50-mal in der Sekunde im Infrarotbereich des Lichts und machen
  so die Ortung der Kamera im freien Raum m&ouml;glich.
</p>

<p>
  Ein weiteres System funktioniert mit speziellen geometrischen Mustern an der
  Studiowand. Hierbei gleicht kein Muster dem anderen und erm&ouml;glicht der
  speziellen Kameraoptik und Software die Positionsbestimmung.
</p>

<p>
  &bdquo;Keying&ldquo; sorgt daf&uuml;r, dass der Computer beim mischen von
  virtuellen und realen Kamerapicsn wei&szlig;, was k&uuml;nstlich und was echt
  ist. Hierf&uuml;r wird das Studio blau oder gr&uuml;n gestrichen. &Uuml;berall
  wo nun die Kamera diese spezielle Farbe aufnimmt, ersetzt der Computer die
  aufgenommenen pics durch die virtuellen.
</p>

<p>
  Schlie&szlig;lich mischen Hochleistungsrechner die virtuellen und die realen
  Aufnahmen zusammen. Wenn Grafiker und Techniker alles richtig gemacht haben,
  ist die Produktion nicht von einer herk&ouml;mmlichen zu unterscheiden.
</p>

<p>
  Die Grenzen des virtuellen Studios ergeben sich aus der Anwendung. Wenn die
  Zeit und das Geld f&uuml;r eine Nachbearbeitung (Post Production) vorhanden
  sind, ist heute schon fast alles m&ouml;glich. Der Realismusgrad einer
  virtuellen Studio Produktion ist dann nur vom Fotorealismus der verwendeten
  Computergrafiken bzw. Kulissen abh&auml;ngig.
</p>

<p>
  Wenn die Verarbeitung in Echtzeit ben&ouml;tigt wird, entstehen Grenzen.
  &Uuml;berall, wo z.B. ein echter Mensch mit der virtuellen Kulisse
  interagiert, ist unter Umst&auml;nden die Illusion gef&auml;hrdet. Noch sind
  auch Wettereffekte wie Wind nicht in Echtzeit m&ouml;glich. Schnee oder
  Regentropfen sind aber bereits darstellbar. Allerdings haben diese Effekte
  noch keinen direkten Einfluss auf den Protagonisten, er wird beispielsweise
  nicht nass. Experten wie Rainer Wollsiefen vom Fraunhofer Institut im
  Schlo&szlig; Birlinghofen bei Sankt Augustin sind sich aber sicher, dass in
  naher Zukunft auch perfekte T&auml;uschungen in Echtzeit m&ouml;glich sind.
</p>

<hr />
<h3>Weiterf&uuml;hrende Links (Quellen):</h3>
<ul>
  <li>
    <a
      href="http://www2.inf.fh-bonn-rhein-sieg.de/mi/lv/vh/ws07/04_vistu/stud/vtv.pdf"
      target="_blank"
      >Virtuelle TV-Studios</a
    >
  </li>
  <li>
    <a href="http://en.wikipedia.org/wiki/Virtual_studio" target="_blank"
      >Wikipedia - Virtual TV-Studio</a
    >
  </li>
  <li>
    <a
      href="http://books.google.de/books?id=N7g3O-4h7_MC&dq=handbuch+der+film+und+videotechnik&printsec=frontcover&source=bl&ots=8J6R3Yd2tx&sig=XkK-CcbyKWXB901-MGUxNqQDeig&hl=de&ei=M0RMS8LsK8TX-Qa6yYiPDQ&sa=X&oi=book_result&ct=result&resnum=2&ved=0CA8Q6AEwAQ#v=onepage&q=&f=false"
      target="_blank"
      >Handbuch der Film- und Videotechnik</a
    >
  </li>
</ul>
